{
  nc: 20,
  depth_multiple: 1.0,
  width_multiple: 1.0,
  anchors: &id001 [[10, 14, 23, 27, 37, 58], [81, 82, 135, 169, 344, 319]],
  search_space:
    {
      BottleneckCSP_Search:
        { gamma_space: [0.25, 0.5, 0.75], bottleneck_space: [1, 2, 3, 4] },
    },
  backbone:
    [
      [-1, 1, Conv, [32, 3, 2]],
      [-1, 1, Conv, [64, 3, 2]],
      [-1, 3, BottleneckCSP, [64]],
      [-1, 1, MP, [2]],
      [-1, 3, BottleneckCSP, [128]],
      [-1, 1, MP, [2]],
      [-1, 3, BottleneckCSP, [256]],
      [-1, 1, MP, [2]],
      [-1, 1, Conv, [512, 3, 1]],
    ],
  head:
    [
      [-1, 1, Bottleneck, [512]],
      [-1, 1, Conv, [128, 1, 1]],
      [-1, 1, nn.Upsample, [null, 2, nearest]],
      [[-1, 6], 1, Concat, [1]],
      [-1, 1, Conv, [256, 1, 1]],
      [[13, 9], 1, Detect, [20, *id001]],
    ],
  csp_gammas: [0.75, 0.75, 0.75],
}
